<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>




  
  
  
  <meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">



  


  
  
  
  
  
  <title>Fehlerbehebung</title>
  <style title="" media="" type="text/css">
.head { margin: 0px;
padding: 0px;
top: 0px;
left: 0px;
right: 0px;
bottom: 0px;
}
body { font-family: Verdana;
font-size: 12px;
}
td { font-family: Verdana;
font-size: 12px;
}
  </style>
</head>


<body>




<table style="text-align: left; width: 100%;" border="0" cellpadding="2" cellspacing="2">




  <tbody>




    <tr>




      <td style="width: 50px;"><img style="width: 47px; height: 27px;" src="hilfe.png" alt=""></td>




      <td>
      
      
      
      <h2 class="head">Fehlerbehebung</h2>




      </td>




    </tr>




  
  
  
  </tbody>
</table>




<hr style="width: 100%; height: 2px;"><br>



<span style="font-weight: bold;">Die Wiedergabe funktioniert nicht - ich h&ouml;re nichts.</span><br>



<ul style="list-style-type: circle;">



  <li>Stellen Sie sicher, dass die Lautst&auml;rke nicht zu niedrig ist</li>



  <li>Stellen Sie sicher, dass alle Kabel verbunden sind. Funktioniert die Soundausgabe mit anderen Programmen?</li>



  <li>Versuchen Sie, die Wiedergabe auf eine andere Soundkarte zu legen:<br>



"Einstellungen -&gt; Player-Einstellungen"</li>



  <li>Wenn Sie den Computer aus dem Ruhezustand aufwecken: Versuchen
Sie, den Player neu zu initialisieren: "Einstellungen -&gt; Erweiterte
Einstellungen"</li>



</ul>



<span style="font-weight: bold;">Die Wiedergabe stottert</span><br>



<ul style="list-style-type: circle;">



  <li>Vergr&ouml;&szlig;ern Sie die Buffergr&ouml;&szlig;e unter "Einstellungen -&gt; Erweiterte Einstellungen"</li>



</ul>



<span style="font-weight: bold;">Die Wiedergabe ist&nbsp;verzerrt</span><br>



<ul style="list-style-type: circle;">



  <li>Ist der <a href="equalizer.html">Equalizer</a> aktiv? Extreme Einstellungen erzeugen fiese Nebeneffekte.</li>



  <li>Versuchen Sie, die Floating-point Channels zu deaktivieren oder das Mixing auf "Software" umzustellen<br>



("Einstellungen -&gt; Erweiterte Einstellungen")</li>



</ul>

<span style="font-weight: bold;">Die Wiedergabe l&auml;uft irgendwie doppelt</span><br>

<ul style="list-style-type: circle;">

  <li>&Uuml;berpr&uuml;fen Sie, ob&nbsp;<a href="Effekte.html">Effekte</a> wie Echo oder Hall aktiviert sind und setzen Sie diese ggf. zur&uuml;ck.</li>

  <li>&Uuml;berpr&uuml;fen Sie, ob die <a href="kopfhoerer.html">Wiedergabe im Kopfh&ouml;rer</a>
l&auml;uft. Wenn auf Ihrem System nur eine Soundkarte installiert ist
(d&uuml;rfte in den meisten F&auml;llen so sein), dann laufen Haupt-
und Kopfh&ouml;rerausgabe auf derselben Karte.<br>

Wenn Sie mehr als eine Soundkarte in Ihrem Rechner haben, k&ouml;nnen Sie die Ausgabe auf die beiden Karten <a href="optionen_a_player-einstellungen.html">aufteilen</a>.</li>

  <li>&Uuml;berpr&uuml;fen Sie, ob Nemp in mehreren Instanzen
l&auml;uft. Normalerweise sollte immer nur eine Instanz von Nemp
gestartet werden k&ouml;nnen, was man in den <a href="optionen_1_allgemein.html">Einstellungen</a> aber &auml;ndern kann.</li>

</ul>

<span style="font-weight: bold;">Die Multimediatasten auf meiner Tastatur funktionieren nicht</span><br>



<ul style="list-style-type: circle;">



  <li>Wenn Sie ein 32-Bit-System haben, k&ouml;nnen Sie versuchen,
die Multimediatasten zu konfigurieren: "Einstellungen -&gt;
Steuerung"</li>



  <li>Sonst: Sorry - die Dinger sind einfach doof und von System zu System anders.</li>



</ul>



<span style="font-weight: bold;">Wenn Nemp l&auml;uft, st&uuml;rzt immer der Internet-Explorer ab!</span><br>



<ul style="list-style-type: circle;">



  <li>Vermutlich haben Sie ein 64-Bit-System und haben trotz Warnung
die Multimediatasten konfiguriert. Starten Sie die Konfiguration erneut
und w&auml;hlen dann "Multimediatasten nicht abfangen".</li>



</ul>



<span style="font-weight: bold;">Der Coverflow findet keine Cover</span><br>



<ul style="list-style-type: circle;">



  <li>Ist die Suche nach Covern im Internet aktiviert?<br>



"Einstellungen -&gt; Player und Cover"</li>



  <li>Ist eine Internetverbindung vorhanden?</li>



  <li>Blockiert eine Firewall die Kommunikation von Nemp? Setzen Sie in Ihrer Firewall eine entsprechende Erlaubnis.</li>



  <li>Sind die Lieder vern&uuml;nftig benannt? Ein Cover kann nur dann
gefunden werden, wenn der Album-Interpret und -Titel richtig ermittelt
werden kann</li>



</ul>



<span style="font-weight: bold;">Ich habe Windows 7, aber in der Fenster-Vorschau sind keine Buttons!</span><br>



<ul style="list-style-type: circle;">



  <li>Stellen sie unter "Einstellungen -&gt; Taskleiste und Tray" einen Punkt ein, der nicht mit einem (*) markiert ist</li>



</ul>



<span style="font-weight: bold;">Das Deskband funktioniert nicht</span><br>



<ul style="list-style-type: circle;">



  <li>Nach der Installation m&uuml;ssen Sie sich kurz abmelden und neu anmelden, damit die &Auml;nderungen in Windows wirksam werden.</li>



  <li>Sie m&uuml;ssen dann das Deskband aktivieren. &Uuml;ber einen Rechtsklick auf die
Taskleiste w&auml;hlen Sie unter "Symbolleisten" das Nemp-Deskband aus<br>



  </li>



</ul>



<span style="font-weight: bold;">Beim Abspielen von Webradio kommt "Unbekanntes Format"</span><br>



<ul style="list-style-type: circle;">



  <li>Versuchen Sie, auf der Webseite eine alternative URL f&uuml;r den
Webstream zu finden. Wenn verf&uuml;gbar, sollte der Link f&uuml;r
"Winamp" mit Nemp gut funktionieren.</li>



  <li>Aktivieren Sie die Option "Parse Stream-Playlist" (in der
Stream-Verwaltung oder unter "Einstellungen -&gt; Webradio") und
probieren Sie einen anderen Links aus</li>



</ul>



<span style="font-weight: bold;">Ich kann kein Webradio aufnehmen</span><br>



<ul style="list-style-type: circle;">



  <li>Nemp kann nur mp3- und aac-Streams aufnehmen. Ogg und WMA geht nicht.</li>



</ul>



<span style="font-weight: bold;">Bei der&nbsp;Aufnahme sind alle Titel zusammen, obwohl ich die Option "Neue Datei bei neuem Titel" aktiviert habe.</span><br>



<ul style="list-style-type: circle;">



  <li>Das Trennen nach Titeln funktioniert nur, wenn der Sender
passende Titel-Informationen mitsendet. Das machen leider nicht alle
Sender.</li>



</ul>



<span style="font-weight: bold;">Der Webserver funktioniert nur innerhalb des lokalen Netzwerkes</span><br>



<ul style="list-style-type: circle;">



  <li>Ist der Zugriff von au&szlig;erhalb erlaubt?</li>



  <li>F&uuml;r den Zugriff von au&szlig;en m&uuml;ssen sie unter
Umst&auml;nden ihren Router so konfigurieren, dass er den Port 80 (TCP)
auf die lokale Adresse Ihres Rechners weiterleitet.<br>



Wie das genau geht, entnehmen Sie bitte der Dokumentation Ihres
Routers. Hilfreich sind dabei oft auch Seiten rund ums Thema
Filesharing - da m&uuml;sssen auch diverse Ports weitergeleitet werden.</li>



</ul>


<span style="font-weight: bold;">Das Scrobbeln funktioniert nicht</span><br>


<ul style="list-style-type: circle;">


  <li>Stellen Sie sicher, dass Sie einen g&uuml;ltigen Account bei last.fm haben</li>


  <li>Stellen Sie sicher, dass eine Internetverbindung besteht und keine Firewall die Verbindung blockiert</li>


  <li>Sie m&uuml;ssen Nemp Zugriff auf Ihr Benutzerprofil auf last.fm erlauben - Details dazu <a href="scrobbeln.html">hier</a>.</li>


</ul>


<br>



</body>
</html>
