<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>



  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  


  
  
  
  <title>Eigenschaften, Dateidetails</title>
  <style title="" media="" type="text/css">
.head { margin: 0px;
padding: 0px;
top: 0px;
left: 0px;
right: 0px;
bottom: 0px;
}
body { font-family: Verdana;
font-size: 12px;
}
  </style>
</head>


<body>



<table style="text-align: left; width: 100%;" border="0" cellpadding="2" cellspacing="2">



  <tbody>



    <tr>



      <td style="width: 50px;"><img style="width: 47px; height: 27px;" src="hilfe.png" alt=""></td>



      <td>
      
      
      <h2 class="head">Eigenschaften, Dateidetails</h2>



      </td>



    </tr>



  
  
  </tbody>
</table>



<hr style="width: 100%; height: 2px;"><br>


Wenn Sie eine Datei in der Playlist oder in der Medienbibliothek
markieren, und &uuml;ber das Popupmen&uuml; den Punkt "Eigenschaften"
w&auml;hlen, dann bekommen Sie in einem weiteren Fenster eine ganze
Reihe Eigenschaften dieser Datei angezeigt.<br>


<br>


<span style="font-weight: bold;">Allgemein</span><br>


Auf der ersten Seite finden Sie die Daten, die in der Medienbibliothek
&uuml;ber diese Datei gespeichert sind. &Uuml;ber den Button "Explorer"
bekommen Sie die Datei im Windows-Explorer angezeigt, &uuml;ber
"Eigenschaften" erhalten Sie den Windows-Eigenschaftsdialog dazu.<br>


Der Button "Aktualisieren" liest die Daten erneut aus dem ID3-Tag (bei
mp3, sonst halt andere Metatags) und &uuml;berschreibt die Daten aus
der Medienbibliothek mit diesen Daten.<br>


Au&szlig;erdem finden Sie auf dieser Seite die Bilddateien, die Nemp
f&uuml;r die Coverauswahl gefunden hat. Durch einen Doppelklick auf das
Bild wird es mit dem Standard-Bildbetrachter ge&ouml;ffnet.<br>


<br>


<span style="font-weight: bold;">Id3-Tags (mp3) / Vorbis Kommentare (ogg, flac)</span><br>


Auf der zweiten Seite k&ouml;nnen Sie die Metadaten der Datei
bearbeiten. Unterst&uuml;tzt werden dabei mp3-Dateien (ID3-Tags), sowie
ogg- und flac-Dateien (Vorbis Kommentare).<br>


Wenn Sie hier Daten ver&auml;ndern, und unten auf "&Uuml;bernehmen"
klicken, werden die Daten in die Datei geschrieben. Dies ist
unabh&auml;ngig von der Einstellung bei den Metadaten.<br>


Da die Bewertungen auch unabh&auml;ngig von der Medienbibliothek
gespeichert werden k&ouml;nnen, gibt es hier einen (oder zwei)
Button(s). &Uuml;ber "Zur&uuml;cksetzen" setzen Sie die Bewertung und
den Abspielz&auml;hler zur&uuml;ck auf Null.<br>


Wenn die Bewertung aus der Medienbibliothek nicht mit der in den Tags
gespeicherten Bewertung &uuml;bereinstimmt, gibt es auch einen Button
"Bewertung synchronisieren", der die Daten aus der Medienbibliothek in
den Tag &uuml;bernimmt.<br>


<br>


<span style="font-weight: bold;">Lyrics &amp; Bilder</span><br>


Auch Liedtexte und Cover k&ouml;nnen direkt in der Musikdatei
gespeichert werden (Cover nicht bei *.ogg). Die Liedtexte
k&ouml;nnen auch automatisiert &uuml;ber lyrics.wikia.com abgerufen
werden.<br>


<br>


<span style="font-weight: bold;">MP3- und ID3-Details</span><br>


Hier werden weitere Informationen &uuml;ber die mp3-Datei angezeigt.
Viele Daten sind f&uuml;r den Normalanwender relativ unwichtig - einzig
die ID3v2-Informationen sind h&auml;ufiger interessant: Wenn die
Version 2.4.0 verwendet wird, hat Windows damit einige Probleme. Wenn
es unter Windows zu Anzeigeproblemen kommt, dann liegt das h&auml;ufig
an dieser Tag-Version.<br>



<br>


<span style="font-weight: bold;">Tags f&uuml;r die Tagwolke</span><br>


Nemp kann auch weitere Tags in den Dateien speichern, die von anderen
Playern nicht verwendet werden k&ouml;nnen. Diese "weiteren Tags"
werden f&uuml;r die Bildung der Tagwolke benutzt. Diese erweiterten
Tags k&ouml;nnen v&ouml;llig beliebig gew&auml;hlt werden. Es sind
sowohl alternative Genre-Einordnungen m&ouml;glich, aber auch sehr
pers&ouml;nliche wie "Lieblingslied" oder "Skiurlaub 2010/11".<br>


<br>


<br>


</body>
</html>
