<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Der Tagwolken-Editor</title>


  <style title="" media="" type="text/css">
.head { margin: 0px;
padding: 0px;
top: 0px;
left: 0px;
right: 0px;
bottom: 0px;
}
body { font-family: Verdana;
font-size: 12px;
}
  </style>
</head>


<body>

<table style="text-align: left; width: 100%;" border="0" cellpadding="2" cellspacing="2">

  <tbody>

    <tr>

      <td style="width: 50px;"><img style="width: 47px; height: 27px;" src="hilfe.png" alt=""></td>

      <td>
      <h2 class="head">Der Tagwolken-Editor</h2>

      </td>

    </tr>

  </tbody>
</table>

<hr style="width: 100%; height: 2px;"><br>
Wenn Sie sich &uuml;ber LastFM zus&auml;tzliche Tags f&uuml;r ihre
Medienbibliothek besorgen, kann es vorkommen, dass f&uuml;r Sie
v&ouml;llig sinnlose Tags dazu kommen, oder einige Tags in
verschiedenen Schreibweisen. <br>
<br>
Mit dem Tagwolken-Editor k&ouml;nnen Sie damit etwas aufr&auml;umen.<br>
<br>
<span style="font-weight: bold;">Existierende Tags</span><br>
Eine Auflistung aller, wirklich aller Tags in der Medienbibliothek, von
h&auml;ufigen wie "Singer-Songwriter" bis hin zu exotischen wie "songs
die so gut sind das ich meiner oma ihr klein haeuschen zwar nicht
verkaufen aber zumindest dafuer beleihen wuerde".<br>
Sie k&ouml;nnen hier Tags umbenennen, zusammenf&uuml;hren oder
l&ouml;schen. Markieren Sie dazu einen oder mehrere Tags
und&nbsp;klicken Sie den entsprechenden Button.<br>
Die Option "<span style="font-weight: bold;">Verstecke Auto-Tags</span>"
sorgt daf&uuml;r, dass die Tags, die Nemp von sich aus erstellt hat
(Interpret, Album, Jahr, Genre, Jahrzehnt) ausgeblendet werden. Diese
Tags k&ouml;nnen Sie nicht ganz ver&auml;ndern. Sie k&ouml;nnen aber
diese AutoTags f&uuml;r Dateien ver&auml;ndern, f&uuml;r die Nemp
diesen Tag nicht selbst hinzugef&uuml;gt hat.<br>
Die Option "<span style="font-weight: bold;">Speichere zusammengef&uuml;hrte/umbenannte/gel&ouml;schte Tags</span>" sorgt daf&uuml;r, dass Ihre Eingaben gespeichert werden und bei k&uuml;nftigen Abfragen an LastFM ber&uuml;cksichtigt werden.<br>
<span style="font-weight: bold;"><br>
Beispiel:</span> Sie f&uuml;hren die beiden Tags "Female Vocalist"
(ohne s am Ende) und "Female Vocalists" (mit s am Ende) zu "Female
Vocalists" zusammen. Wenn sie sp&auml;ter f&uuml;r ein Lied Tags von
LastFM holen, und dieses Lied ist mit "Female Vocalist" (ohne s)
getaggt, wird dieser Tag automatisch zu "Female Vocalists" (mit s)
ge&auml;ndert.<br>
<br>
<br>
<span style="font-weight: bold;">Zusammengef&uuml;hrte/umbenannte Tags</span><br>
In diesem Tab werden die Tags angezeigt, die sie zuvor umbenannt oder
zusammengef&uuml;hrt haben. Diese Liste wird beim Holen neuer Tags von
LastFM ber&uuml;cksichtigt, sodass die Tagwolke dadurch nicht wieder
aufs neue zugem&uuml;llt wird.<br>
<br>
<br>
<span style="font-weight: bold;">Gel&ouml;schte Tags</span><br>
Tags, die sie nicht in Ihrer Tagwolke sehen wollen. Auch diese Liste wird beim Holen neuer Tags ber&uuml;cksichtigt.<br>
<br>
<br>
<span style="font-weight: bold;">Dateien aktualisieren</span><br>
Wenn Sie Tags umbenannt, zusammengef&uuml;hrt oder gel&ouml;scht haben,
sollten Sie im Anschluss auch die Information in den
mp3-Dateien selbst &auml;ndern lassen. Dieser Vorgang dauert eine
Weile, in der Regel ein wenig l&auml;nger als das Einlesen der Daten in
die Medienbibliothek am Anfang.<br>
<br>
<br>
<span style="font-weight: bold;">Bugfix</span><br>
In einer fr&uuml;heren Testversion von Nemp 4 war ein bl&ouml;der
Fehler drin, der dazu f&uuml;hrte, dass die Tags nicht richtig in die
Datei geschrieben wurden. In dieser Version von Nemp ist daher eine
Funktion eingebaut, die diesen Fehler in den Dateien korrigieren kann.<br>
Wenn Sie Nemp 4 zum ersten Mal benutzen, und keine Pre-Alpha-Version
getestet haben, k&ouml;nnen Sie diese Funktion getrost ignorieren.
</body>
</html>
